Repository: lazezmahrous/math_app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# app_name
source: Fun Math
ar: رياضيات ممتعه

# onboard_description
source: Master the basics of math effortlessly with MathMaster, your go-to app for a seamless learning experience.
ar: أتقن أساسيات الرياضيات دون عناء مع MathMaster، التطبيق المفضل لديك لتجربة علمية سلسة..

# onboard_title
source: Math Foundation
ar: تأسيس الرياضيات

# onboard_title_tow
source: The best foundational mathematics curriculum
ar: أفضل منهج لتأسيس الرياضيات

# onboard_button
source: Let's Start
ar: لنبدأ

# home_title
source: Welcome Back ðŸ‘‹
ar: مرحبا بعودتك 👋

# home_score_board_numbers
source: Correct Problems
ar: المسائل الصحيحه :

# home_score_board_counter_score
source: Correct Problems on the Counter
ar: مسائل صحيحه علي العداد :

# home_feature_stories
source: Stories
ar: القصص

# home_feature_start_test
source: Start Test
ar: بدأ إختبار

# home_feature_learn_on_counter
source: Learn with the Counter
ar: تعلم علي العداد

# home_feature_learn_on_counter_field_empty
source: Enter Number !
ar: أدخل الرقم !

# home_feature_stories_learn_addition_header
source: Stories for Learning Addition (+)
ar: قصص لتلعيم الجمع (+)

# home_feature_stories_learn_subtraction_header
source: Stories for Learning Subtraction (-)
ar: قصص لتعليم الطرح (-)

# feature_stories_no_connection
source: Connect to the internet to watch the story video
ar: إتصل بالإنترنت لمشاهدة القصه فيديو

# feature_start_test_operation_count
source: Operations Count
ar: عدد العمليات

# feature_start_test_operation_count_error
source: The number of operations must be 2 or more
ar: عدد العمليات يجب أن يكون أكبر من أو يساوي 2

# feature_start_test_numbers_speed
source: Numbers Speed
ar: سرعة عرض الأرقام

# feature_start_test_numbers_speed_error
source: The display speed must be 1 or more
ar: سرعة عرض الأرقام يجب أن تكون أكبر من أو تساوي 1

# feature_start_test_select_level
source: Level
ar: المستوي

# feature_start_test_change_level
source: Change Level
ar: تغير المستوي

# feature_start_test_select_level_one
source: Level One (0 To 5)
ar: المستوي الأول (0 إلي 5)

# feature_start_test_select_level_tow
source: Level One (6 To 9)
ar: المستوي الثاني (6 إلي 9)

# feature_enter_result_header
source: Choose the correct answer:
ar: إختر الإجابه الصحيحه :

# feature_success_screen
source: Correct Answer!
ar: إجابة صحيحه !

# feature_failure_screen
source: Wrong Answer!
ar: إجابة خطأ !

# feature_success_and_failure_screen_button_one
source: Home
ar: الصفحة الرئيسية

# feature_success_and_failure_screen_button_tow
source: Play Again
ar: لعب مرة أخري

# feature_learn_on_counter_header
source: Focus on the counter and guess the number:
ar: ركز علي العداد وخمن الرقم :

# feature_learn_on_counter_text_field_hint_text
source: Number??
ar: الرقم ؟؟

# feature_learn_on_counter_next_button
source: Next
ar: التالي

# feature_set_language
source: Change language
ar: تغير اللغة

# level_title
source: Level Information
ar: معلومات المستوي

# level_one
source: Novice
ar: هاو

# level_one_description
source: Level one from 0 to 100
ar: المستوي الأول من 0 إلي 100

# level_tow
source: Beginner
ar: مبتدأ

# level_tow_description
source: Level one from 100 to 200
ar: المستوي الأول من 100 إلي 200

# level_three
source: Intermediate
ar: متوسط

# level_three_description
source: Level one from 200 to 500
ar: المستوي الأول من 200 إلي 500

# level_four
source: Expert
ar: محترف

# level_four_description
source: Level one from 500 to 1000
ar: المستوي الأول من 500 إلي 1000

# level_five
source: Legend
ar: أُسطوره

# level_five_description
source: Level one from 1000 to 5000
ar: المستوي الأول من 1000 إلي 5000

# counter_timer_fenish
source: 5 successful attempts were completed today The evaluation will be re-evaluated within
ar: تم إجتياز 5 محاولات ناجحة اليوم سيتم إعادة التقييم خلال

# time_fenish
source: Time Over !
ar: إنتهي الوقت !

source: Minut
ar: دقيقة

source: Refresh
ar: تحديث
